---
kind: type
id: T:Autodesk.Revit.Exceptions.FunctionId
source: html/f510babd-969e-98fd-530e-c58fe4c9e5ca.htm
---
# Autodesk.Revit.Exceptions.FunctionId

The information of a function throwing an exception.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class FunctionId : ISerializable
```